{"CURRICULUM":[{"id":"ACCT151","information":{"dept":"ACCT","coursenum":"151","title":"Introduction to Financial Accounting","coursedesc":"The organization, measurement and interpretation of economic information. Introduction to accounting theory, concepts and principles, the accounting cycle, information processing, and financial statements. Exposure to controversial issues concerning income determination and valuation. Must have sophomore standing.","coursenotes":"ACCT 151 is typically taken sophomore year fall and followed by ACCT 152 in sophomore spring.","credits":3,"recprofs":"Manzo, Gupta","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"ACCT152","information":{"dept":"ACCT","coursenum":"152","title":"Introduction to Managerial Accounting","coursedesc":"An introduction to internal accounting information for all levels of management. Topics include cost flow in a manufacturing operation; planning, evaluating and controlling through budgeting and standard costing; and decision-making using cost-volume-profit analysis, direct costing, and relevant costs.","coursenotes":"ACCT 151 is typically taken sophomore year fall and followed by ACCT 152 in sophomore spring. ACCT 152 is required for the Lehigh in Prague Program.","credits":3,"recprofs":"Manzo, Gupta","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":["ACCT151"],"_2019":["ACCT151"]}}},{"id":"BUS001","information":{"dept":"BUS","coursenum":"001","title":"Introduction to Business in a Global Environment","coursedesc":"An introduction to business, emphasizing critical issues impacting the business world, such as globalization, technology, ethics, and diversity. Provides an overview of the various functional areas of business and how they fit together. Stresses experiential learning and develops team-building skills. Strengthens written and oral communications skills. Provides an introduction to career opportunities and curriculum choices in business and economics. is offered only in the fall and is open only to College of Business and Economics students.","coursenotes":"Had traditionally been 3 credits, but has become 1 credit starting for the fall 2019. Transfers from Engineering and A&S must take this.","credits":1,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"BUS002","information":{"dept":"BUS","coursenum":"002","title":"Introduction to Business In a Global Environment (for Non First-Year Students)","coursedesc":"An introduction to business, emphasizing critical issues impacting the business world, such as globalization, technology, ethics, and diversity. Bridges the functional depth students bring from various introductory business courses to provide an overview of the various functional areas of business and how they fit together and can be applied to address real business issues and challenges. Stresses experiential learning (e.g., case studies) and develops team-building skills. Strengthens written and oral communication skills.","coursenotes":"BUS 002 has historically been BUS 001 for transfers into the College of Business. Unknown if it will be offered again.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"BUS003","information":{"dept":"BUS","coursenum":"003","title":"Business Communication I","coursedesc":"New Business Communication course for the class of 2023. Designed to be taken for CSB first year fall.","coursenotes":"CSB Class of 2023 students should take this first semester.","credits":1.5,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"BUS203","information":{"dept":"BUS","coursenum":"203","title":"Business Communication II","coursedesc":"New Business Communication course for the class of 2023. Designed to be taken for CSB junior year fall.","coursenotes":"CSB Class of 2023 students should take this fall junior year.","credits":1.5,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":null},"prereqs":{"_2018":["BUS003"],"_2019":["BUS003"]}}},{"id":"CSB311","information":{"dept":"CSB","coursenum":"311","title":"Computer Applications in Business","coursedesc":"Application of computer technology to business problems. Transaction processing systems that support the revenue, conversion, and expenditure cycles of manufacturing, service, and retail business organizations. Topics include process modeling, data modeling, internal controls, corporate IT governance, IT audit techniques, SAP and application of Generalized Audit Software.","coursenotes":"Take sophomore year spring if doing Lehigh in Prague, otherwise must be done junior year spring.","credits":3,"recprofs":"Hall","attributes":null,"schedule":{"winter":null,"fall":null,"spring":true,"summer":null},"prereqs":{"_2018":[["CSE241","CSE341"],"ACCT152"],"_2019":[["CSE241","CSE341"],"ACCT152"]}}},{"id":"CSB312","information":{"dept":"CSB","coursenum":"312","title":"Design of Integrated Business Applications I","coursedesc":"Integrated Product Development (IPD) Capstone I. Industry-based business information systems design project. Information systems design methodology, user needs analysis, project feasibility analysis of design alternatives, and integrated product development methodology. Formal oral and written presentations to clients.","coursenotes":"Take junior year spring.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":true,"summer":null},"prereqs":{"_2018":["CSB311","CSE216"],"_2019":["CSB311","CSE216"]}}},{"id":"CSB313","information":{"dept":"CSB","coursenum":"313","title":"Design of Integrated Business Applications II","coursedesc":"Integrated Product Development (IPD) Capstone Course II. This course extends the industry-based project initiated in CSB 312 into its implementation phase. Detailed design, in-house system construction and delivery, commercial software options, and systems maintenance and support. The practical component of the course is supplemented by several classroom-based modules dealing with topics that lie at the boundary of computer science and business. Formal, oral, and written presentations to clients.","coursenotes":"Take senior year fall.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":["CSB312"],"_2019":["CSB312"]}}},{"id":"CSE001","information":{"dept":"CSE","coursenum":"001","title":"Breadth of Computing","coursedesc":"Broad overview of computer science, computer systems, and computer applications. Interactive Web page development. Includes laboratory. Not available to students who have taken CSE 012 or ENGR 010.","coursenotes":"Take first year fall, can be substituted with ENGR 010 or CSE 012 for transfer students.","credits":2,"recprofs":"Korth, Carr","attributes":null,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"CSE002","information":{"dept":"CSE","coursenum":"002","title":"Fundamentals of Programming","coursedesc":"Problem-solving and object-oriented programming using Java. Includes laboratory. No prior programming experience needed.","coursenotes":"Be prepared for more than 2 credits worth of work.","credits":2,"recprofs":"Chen, Carr","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"CSE012","information":{"dept":"CSE","coursenum":"012","title":"Survey of Computer Science","coursedesc":"Fundamental concepts of computing and \"computational thinking\": problem analysis, abstraction, algorithms, digital representation of information, and networks. Applications of computing and communication that have changed the world. Impact of computing on society. Concepts of software development using a scripting language such as Python, Perl, or Ruby. Not available to students who have taken CSE 015 or CSE 001.","coursenotes":"Take as a substitute for CSE 001 if you transferred in, or got credit for AP CS Principles.","credits":3,"recprofs":"Kalafut","attributes":null,"schedule":{"winter":null,"fall":null,"spring":true,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"CSE017","information":{"dept":"CSE","coursenum":"017","title":"Programming and Data Structures","coursedesc":"Algorithmic design and implementation in a high level, object oriented language, such as Java. Classes, subclasses, recursion, searching, sorting, linked lists, trees, stacks, queues.","coursenotes":"This class is very important for interviews, make sure to include this on your resume as a listed course as \"Data Structures & Algorithms\".","credits":3,"recprofs":"Heflin, Montella","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":["CSE002",["CSE001","CSE012","ENGR010"]],"_2019":["CSE002",["CSE001","CSE012","ENGR010"]]}}},{"id":"CSE109","information":{"dept":"CSE","coursenum":"109","title":"Systems Software","coursedesc":"Advanced programming and data structures, including dynamic structures, memory allocation, data organization, symbol tables, hash tables, B-trees, data files. Object-oriented design and implementation of simple assemblers, loaders, interpreters, compilers, and translators. Practical methods for implementing medium-scale programs.","coursenotes":"This class has traditionally been considered a \"weed-out\" course, but has become more reasonable over the years. Begins the low-level sequence of CSE109/CSE202/CSE303.","credits":4,"recprofs":"Montella, Erle","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":["CSE017"],"_2019":["CSE017"]}}},{"id":"CSE140","information":{"dept":"CSE","coursenum":"140","title":"Foundations of Discrete Structures and Algorithms","coursedesc":"Basic representations used in algorithms: propositional and predicate logic, set operations and functions, relations and their representations, matrices and their representations, graphs and their representations, trees and their representations. Basic formalizations for proving algorithm correctness: logical consequences, induction, structural induction. Basic formalizations for algorithm analysis: counting, pigeonhole principle, permutations.","coursenotes":"No coding required, more of a math course really. This course used to be called CSE 198 and CSE/MATH 261 in years prior. Recommended to get the CSE140/CSE340 sequence done early, as CSE340 and algorithms are very important for interviewing at any of the big tech companies - ie. Google, Amazon, Facebook.","credits":3,"recprofs":"Wang, Carr","attributes":null,"schedule":{"winter":null,"fall":null,"spring":true,"summer":null},"prereqs":{"_2018":[["MATH021","MATH031","MATH076"]],"_2019":[["MATH021","MATH031","MATH076"]]}}},{"id":"CSE202","information":{"dept":"CSE","coursenum":"202","title":"Computer Organization and Architecture","coursedesc":"Interaction between low-level computer architectural properties and high-level program behaviors: instruction set design; digital logic and assembly language; processor organization; the memory hierarchy; multicore and GPU architectures; and processor interrupt/exception models. Credit will not be given for both CSE 201 and CSE 202.","coursenotes":"Considered a \"hard\" course, continues the low-level sequence of CSE109/CSE202/CSE303. Book is very helpful, utilize it. Take by junior year spring.","credits":3,"recprofs":"Erle","attributes":null,"schedule":{"winter":null,"fall":null,"spring":true,"summer":null},"prereqs":{"_2018":["CSE017"],"_2019":["CSE017"]}}},{"id":"CSE216","information":{"dept":"CSE","coursenum":"216","title":"Software Engineering","coursedesc":"The software lifecycle; lifecycle models; software planning; testing; specification methods; maintenance. Emphasis on team work and large-scale software systems, including oral presentations and written reports.","coursenotes":"The majority of class is a group software engineering project, pick your groups wisely. Must be completed by fall junior year.","credits":3,"recprofs":"Spear","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":null},"prereqs":{"_2018":["CSE017"],"_2019":["CSE017"]}}},{"id":"CSE241","information":{"dept":"CSE","coursenum":"241","title":"Database Systems and Applications","coursedesc":"Design of large databases: Integration of databases and applications using SQL and JDBC; transaction processing; performance tuning; data mining and data warehouses. Not available to students who have credit for CSE 341 or IE 224.","coursenotes":"Don't wait until the last week to start the project. Or do, let me know how it goes. Very important for anyone more business-heavy or interested in the intersection of CS and Business. Take by sophomore year spring.","credits":3,"recprofs":"Korth","attributes":null,"schedule":{"winter":null,"fall":null,"spring":true,"summer":null},"prereqs":{"_2018":["CSE017"],"_2019":["CSE017"]}}},{"id":"CSE252","information":{"dept":"CSE","coursenum":"252","title":" Computers, the Internet, and Society","coursedesc":"An interactive exploration of the current and future role of computers, the Internet, and related technologies in changing the standard of living, work environments, society and its ethical values. Privacy, security, depersonalization, responsibility, and professional ethics; the role of computer and Internet technologies in changing education, business modalities, collaboration mechanisms, and everyday life.","coursenotes":"Many students take this during the Lehigh in Prague program, if you want to do Lehigh in Prague, make sure to save it for then! Take it by spring senior year.","credits":3,"recprofs":"Kalafut","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"CSE262","information":{"dept":"CSE","coursenum":"262","title":"Programming Languages","coursedesc":"Use, structure and implementation of several programming languages.","coursenotes":"Gives a good overview of different programming language constructs, good to help with interview questions. Take it by fall senior year.","credits":3,"recprofs":"Montella","attributes":null,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":["CSE017"],"_2019":["CSE017"]}}},{"id":"CSE303","information":{"dept":"CSE","coursenum":"303","title":"Operating System Design","coursedesc":"Process and thread programming models, management, and scheduling. Resource sharing and deadlocks. Memory management, including virtual memory and page replacement strategies. I/O issues in the operating system. File system implementation. Multiprocessing. Computer security as it impacts the operating system.","coursenotes":"Considered a \"very hard\" course, finishes the low-level sequence of CSE109/CSE202/CSE303. The \"final boss\" of required courses. Take it by fall senior year.","credits":3,"recprofs":"Spear","attributes":null,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":["CSE109","CSE202"],"_2019":["CSE109","CSE202"]}}},{"id":"CSE340","information":{"dept":"CSE","coursenum":"340","title":"Design and Analysis of Algorithms","coursedesc":"Algorithms for searching, sorting, manipulating graphs and trees, finding shortest paths and minimum spanning trees, scheduling tasks, etc.: proofs of their correctness and analysis of their asymptotic runtime and memory demands. Designing algorithms: recursion, divide-and-conquer, greediness, dynamic programming. Limits on algorithm efficiency using elementary NP-completeness theory.","coursenotes":"UBER important for landing a job at the big tech companies like Google, Amazon, etc. Recommended to get the CSE140/CSE340 sequence done early if possible. 140 is spring only, and 340 is fall only, so do them in consecutive semesters. Make sure to include \"Analysis of Algorithms\" on your resume. Take it by fall senior year.","credits":3,"recprofs":"Korth, Carr","attributes":null,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":["CSE140"],"_2019":["CSE140"]}}},{"id":"CSE341","information":{"dept":"CSE","coursenum":"341","title":"Database Systems, Algorithms, and Applications","coursedesc":"Design of large databases; normalization; query languages (including SQL); Transaction-processing protocols; Query optimization; performance tuning; distributed systems. Not available to students who have credit for CSE 241.","coursenotes":"A more rigorous and more theoretical version of CSE241. Consider taking it if you're strong and math and are looking at CS grad school. Again, don't wait until the last week on the project. Take it by spring sophomore year.","credits":3,"recprofs":"Korth","attributes":null,"schedule":{"winter":null,"fall":null,"spring":true,"summer":null},"prereqs":{"_2018":["CSE017"],"_2019":["CSE017"]}}},{"id":"ECO001","information":{"dept":"ECO","coursenum":"001","title":"Principles of Economics","coursedesc":"A one-semester course in the principles of economics. General topics covered are: supply and demand; pricing and production decisions of firms; the role of government in the economy; the determination of national income; money and banking; monetary and fiscal policy; and government finance.","coursenotes":"Harder than you'd expect for a 001 course, especially with Gunter. There is a lot of material to cover, especially if you've never taken a business course before.","credits":4,"recprofs":"Gunter","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"ECO029","information":{"dept":"ECO","coursenum":"029","title":"Money, Banking, and Financial Markets","coursedesc":"The nature and functions of money. Global money and financial markets. The role of commercial and central banks. Effects of the interest rate, exchange rate, and the money supply on the economy. Examination and evaluation of current and past monetary policies.","coursenotes":"Becoming phased out for the class of 2023, last time it is offered is fall 2019.","credits":3,"recprofs":"Panovska, Rzevhsky","attributes":null,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":["ECO001"],"_2019":["ECO001"]}}},{"id":"ECO045","information":{"dept":"ECO","coursenum":"045","title":"Statistical Methods","coursedesc":"Descriptive statistics, probability and probability distributions, sampling, estimation, hypothesis testing, chi-square tests, simple regression and correlation. Note: CBE students may not take MATH 012 as a replacement for ECO 045.","coursenotes":"Statistics, easier than MATH231. It is strongly recommended to take MATH231 instead of this course if you're interested in CS grad school or the Data Science minor.","credits":3,"recprofs":"Taylor","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"ECO119","information":{"dept":"ECO","coursenum":"119","title":"Intermediate Macroeconomic Analysis","coursedesc":"Macroeconomic measurement, theory and policy. The use of alternative macroeconomic models to analyze the level of national income, inflation, unemployment, economic growth; the balance of payments, and exchange rate determination.","coursenotes":"More math-intensive than you'd expect, one of the harder business core courses. Students in the class of 2023 have the choice between this course and ECO146, 119 covers macroeconomics, and 146 microeconomics.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":["ECO001"],"_2019":["ECO001"]}}},{"id":"ECO146","information":{"dept":"ECO","coursenum":"146","title":"Applied Microeconomic Analysis","coursedesc":"The application of economic analysis to managerial and public policy decision-making. Not available for credit to students who have taken ECO 105.","coursenotes":"More math-intensive than you'd expect, one of the harder business core courses. Students in the class of 2023 have the choice between this course and ECO146, 119 covers macroeconomics, and 146 microeconomics.","credits":3,"recprofs":"Dai, Yi-Chou","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":["ECO001",["MATH021","MATH031","MATH076"]],"_2019":["ECO001",["MATH021","MATH031","MATH076"]]}}},{"id":"ENGL001","information":{"dept":"ENGL","coursenum":"001","title":"Critical Reading and Composition","coursedesc":"Introduction to academic writing that supports a claim in respectful conversation with others. Topics drawn from important issues in the world in which students live. The course provides multiple opportunities to engage thoughtfully in the writing process. Students must receive a grade of C- or higher to advance to English 2.","coursenotes":"Can be placed out of with AP credit.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"ENGL002","information":{"dept":"ENGL","coursenum":"002","title":"Research and Argument","coursedesc":"Continuation of ENGL 1. Designed to refine the skills of argument and research. Students will make persuasive, thoughtful, and well-supported arguments in a variety of forms, including multi-modal genres. The course provides a number of occasions to think, research, and write about pressing issues of public concern. Must have a grade of C- or higher in English 1.","coursenotes":"No longer required for the class of 2023.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":true,"summer":null},"prereqs":{"_2018":["ENGL001"],"_2019":["ENGL001"]}}},{"id":"ENGL003","information":{"dept":"ENGL","coursenum":"003","title":"Composition and Literature I for International Writers","coursedesc":"Students improve both their advanced academic written English and academic writing style through a process of reading fiction and non-fiction and by writing well-organized, coherent essays for academics. Author citation, style, and written fluency and accuracy are addressed within students’ writing. Enrollment is limited to nonnative speakers; prior academic writing history, English placement testing, and/or ESL director’s recommendation determines placement.","coursenotes":"For international students only.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"ENGL005","information":{"dept":"ENGL","coursenum":"005","title":"Composition and Literature II for International Writers","coursedesc":"Continuation of English 3. Students practice more advanced methods and modes of writing for academics, including writing and reading for their specific field of study. Students continue to work on advanced written fluency and accuracy of idiomatic language and expression and are taught advanced methods of author citation and source integration.","coursenotes":"For international students only. No longer required for the class of 2023.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":true,"summer":null},"prereqs":{"_2018":[["ENGL001","ENGL003"]],"_2019":[["ENGL001","ENGL003"]]}}},{"id":"ENGL011","information":{"dept":"ENGL","coursenum":"011","title":"Seminar in Critical Reading & Writing","coursedesc":"English 11 is designed to deepen your skills in critical reading and writing through a close engagement with literary and cultural texts and advanced training in best writing practices. You will make persuasive, thoughtful, and well-supported arguments in a variety of forms.","coursenotes":"Only for students who received AP credit for ENGL 001. Unknown if students in the class of 2023 will need to take this course.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":["ENGL001"],"_2019":["ENGL001"]}}},{"id":"ENGR005","information":{"dept":"ENGR","coursenum":"005","title":"Introduction to Engineering Practice","coursedesc":"First year practical engineering experience; introduction to concepts, methods and principles of engineering practice. Problem solving, design, project planning, communication, teamwork, ethics and professionalism; innovative solution development and implementation. Introduction to various engineering disciplines and degree programs. Mandatory for and open only for first year RCEAS students.","coursenotes":"Has historically counted as a subsitute for BUS 001 for transfers from Engineering, but no more.","credits":2,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"ENGR010","information":{"dept":"ENGR","coursenum":"010","title":"Applied Engineering Computer Methods","coursedesc":"Introduction to programming for engineering tasks. Use of Matlab to program and solve engineering problems. Interfacing sensors and actuators to a microcontroller board and programming to interact with the world. Computer lab setting. Final project controls engineering equipment.","coursenotes":"Serves as a substitute for CSE 001 for transfers from the college of Engineering.","credits":2,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"FIN125","information":{"dept":"FIN","coursenum":"125","title":"Introduction to Finance","coursedesc":"An introductory finance course stressing the links between corporate finance and investments. Major topic areas will include financial statement analysis, time value of money, risk and return valuation of stocks and bonds, capital budgeting, and cost of capital.","coursenotes":"The intersection of finance and technology is a hot recruiting area, take this course early if you're interested.","credits":3,"recprofs":"Nikolsko-Rzhevska","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":["ACCT151","ECO029",["ECO045","MATH231"],["MATH021","MATH031","MATH076"]],"_2019":["ACCT151",["ECO045","MATH231"],["MATH021","MATH031","MATH076"]]}}},{"id":"LAW201","information":{"dept":"LAW","coursenum":"201","title":"Legal Environment of Business","coursedesc":"This course examines the legal relationships between business and government, business and society, and the individual and society. A significant focus of the course is on the structure of the U.S. legal system, the role of the courts in the legal system, and contract law as the principal mechanism for the private allocation of resources and risk allocation. The course also focuses on business ethics with particular emphasis on corporate social responsibility. Junior standing is required.","coursenotes":"Considered one of the easier courses of the business core, take it to balance your schedule.","credits":3,"recprofs":"Melone, Nation, McCormick","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":["ECO001"],"_2019":["ECO001"]}}},{"id":"MATH021","information":{"dept":"MATH","coursenum":"021","title":"Calculus I","coursedesc":"Functions and graphs; limits and continuity; derivative, differential, and applications; indefinite and definite integrals; trigonometric, logarithmic, exponential, and hyperbolic functions.","coursenotes":"Take your AP credit and run. Calculus at Lehigh is hard.","credits":4,"recprofs":"Coll","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"MATH022","information":{"dept":"MATH","coursenum":"022","title":"Calculus II","coursedesc":"Applications of integration; techniques of integration; separable differential equations; infinite sequences and series; Taylor's Theorem and other approximations; curves and vectors in the plane.","coursenotes":"Take your AP credit and run. Calculus at Lehigh is hard.","credits":4,"recprofs":"Coll","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":[["MATH021","MATH031"]],"_2019":[["MATH021","MATH031"]]}}},{"id":"MATH031","information":{"dept":"MATH","coursenum":"031","title":"Honors Calculus I","coursedesc":"Same topics as in MATH 021, but taught from a more thorough and rigorous point of view.","coursenotes":"Take your AP credit and run. Calculus at Lehigh is hard.","credits":4,"recprofs":"Coll","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"MATH032","information":{"dept":"MATH","coursenum":"032","title":"Honors Calculus II","coursedesc":"Same topics as in MATH 022, but taught from a more thorough and rigorous point of view.","coursenotes":"Take your AP credit and run. Calculus at Lehigh is hard.","credits":4,"recprofs":"Coll","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":["MATH031"],"_2019":["MATH031"]}}},{"id":"MATH075","information":{"dept":"MATH","coursenum":"075","title":"Calculus I, Part A","coursedesc":"Covers the same material as the first half of MATH 021. Meets three hours per week, allowing more class time for each topic than does MATH 021.","coursenotes":"MATH 075 and MATH 076 serve as a substitute for MATH 021, you can do this switch and still graduate on time. Take MATH 075 fall first-year if so.","credits":2,"recprofs":"Coll","attributes":null,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"MATH076","information":{"dept":"MATH","coursenum":"076","title":"Calculus I, Part B","coursedesc":"Continuation of MATH 075, covering the second half of MATH 021. Meets three hours per week. Final exam for this course is similar to the MATH 021 final.","coursenotes":"MATH 075 and MATH 076 serve as a substitute for MATH 021, you can do this switch and still graduate on time. Take MATH 076 spring first-year if so.","credits":2,"recprofs":"Coll","attributes":null,"schedule":{"winter":null,"fall":null,"spring":true,"summer":null},"prereqs":{"_2018":["MATH075"],"_2019":["MATH075"]}}},{"id":"MATH205","information":{"dept":"MATH","coursenum":"205","title":"Linear Methods","coursedesc":"Linear differential equations and applications; matrices and systems of linear equations; vector spaces; eigenvalues and application to linear systems of differential equations.","coursenotes":"The linear algebra part of the class is very important if you want to do graduate CS, so pay attention.","credits":3,"recprofs":"Coll","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":null},"prereqs":{"_2018":[["MATH022","MATH032"]],"_2019":[["MATH022","MATH032"]]}}},{"id":"MATH231","information":{"dept":"MATH","coursenum":"231","title":"Probability and Statistics","coursedesc":"Probability and distribution of random variables; populations and random sampling; chi-square and t distributions; estimation and tests of hypotheses; correlation and regression theory of two variables. Not available for credit to students who have completed both MATH 263 and MATH 264.","coursenotes":"A harder course than ECO 045, but highly recommended for anyone considering CS grad school or the Data Science Minor. Note the Calc II prerequisite.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":null},"prereqs":{"_2018":[["MATH022","MATH032"]],"_2019":[["MATH022","MATH032"]]}}},{"id":"MGT043","information":{"dept":"MGT","coursenum":"043","title":"Organizational Behavior","coursedesc":"New Course","coursenotes":"New course for the class of 2023, take spring first year.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":true,"summer":null},"prereqs":{"_2018":["BUS001","ECO001"],"_2019":["BUS001","ECO001"]}}},{"id":"MGT301","information":{"dept":"MGT","coursenum":"301","title":"Strategic Management in a Global Environment","coursedesc":"The capstone business class, integrating concepts and practices from the core business classes, utilizing an organizationwide strategic perspective and examining the relationship among firm strategy, structure and environment. The course emphasizes strategic analysis strategy formulation, and strategy implementation so as to achieve sustainable competitive advantage. Corporate governance, corporate social responsibility and business ethics are incorporated into the strategic perspective. Case analyses and competitive simulation game are the central learning components. Must have senior standing in the College of Business and Economics, and completion of the college core.","coursenotes":"The college of business capstone, you must complete all other business core courses before you can take it.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":null},"prereqs":{"_2018":["BUS001","FIN125","LAW201","ECO146","CSB311","MKT111","SCM186"],"_2019":["BUS001","FIN125","LAW201",["ECO146","ECO119"],"CSB311","MKT111","SCM186","BUS203"]}}},{"id":"MKT111","information":{"dept":"MKT","coursenum":"111","title":"Principles of Marketing","coursedesc":"The purpose of this course is to give an overview of the entire marketing function. The objective is to take a broad-based approach to expose students to the meaning of marketing, the terminology of marketing, the activities involved in marketing, how managers make and implement decisions in marketing, and how they evaluate the results. The role of marketing in the broader society will also be discussed. At the end of this course, students will be able to understand the meaning of the marketing concept, various marketing terminologies, how firms develop and evaluate marketing strategies related to product, place, price, and promotions, how marketing strategies are related to other strategies of the firm, and what internal and external factors influence the marketing decisions. The outcome of the course will be assessed by a series of multiple choice and short essay questions, and other suitable assignments decided by the instructor.","coursenotes":"Make sure to read the book for the exams! Professor Wang teaches marketing analytics if you're interested in data science, so take her for MKT 111 if you're interested!","credits":3,"recprofs":"Savino, Wang","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":["ECO001"],"_2019":["ECO001"]}}},{"id":"SCM186","information":{"dept":"SCM","coursenum":"186","title":"Supply Chain Operations Management","coursedesc":"Introduction to managing global supply chains and operations within the context of an integrated value chain. Topics include supply chain management, total quality management, project management, demand forecasting, supply management, lean operations, aggregate planning, capacity planning, inventory management, distribution and transportation management, and performance measurement.","coursenotes":"Try to get a reliable contact for the term project - it can make it much easier to complete.","credits":3,"recprofs":"Coles","attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":[["MATH021","MATH031","MATH076"],["ECO045","MATH231"]],"_2019":[["MATH021","MATH031","MATH076"],["ECO045","MATH231"]]}}},{"id":"ANTH012","information":{"dept":"ANTH","coursenum":"012","title":"Human Evolution and Prehistory","coursedesc":"Introductory biological anthropology and prehistory. Adaptive functions of human culture and its relation to biological evolution. Mechanisms of evolution, non-human primate morphology and behavior, hominid fossil record, cultural beginnings, and survey of world prehistory.","coursenotes":"A good way to get 4 credits of NS done.","credits":4,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"ASTR007","_cx0b9":"ASTR008","information":{"dept":"ASTR","coursenum":"007","title":"Introduction to Astronomy","coursedesc":"Introduction to planetary, stellar, galactic, and extragalactic astronomy. An examination of the surface characteristics, atmospheres, and motions of planets and other bodies in our solar system. Properties of the sun, stars, and galaxies, including the birth and death of stars, stellar explosions, and the formation of stellar remnants such as white dwarfs, neutron stars, pulsars, and black holes. Quasars, cosmology, and the evolution of the universe. May not be taken by students who have previously completed ASTR 105, PHY 105, ASTR 301, PHY 301, ASTR 302 OR PHY 302.","coursenotes":"Designed to be taken in conjunction with ASTR 008.","credits":3,"recprofs":null,"attributes":"ASTR008","schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"ASTR008","information":{"dept":"ASTR","coursenum":"008","title":"Introduction to Astronomy Laboratory","coursedesc":"Laboratory to accompany ASTR 007. Must be enrolled concurrently in ASTR 007.","coursenotes":"Take with ASTR 007.","credits":1,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"ASTR105","_d9ney":"TRUE","information":{"dept":"ASTR","coursenum":"105","title":"Introduction to Planetary Astronomy","coursedesc":"This course is an introduction to the solar system. Topics include observations of the sky, transition from the geocentric to the heliocentric paradigm, gravitational interactions, formation and evolution of the solar system, the structure of and energy production in the Sun, survey of the planets in the solar system, including their dynamics, interiors, atmospheres, composition, and moons, the nature of asteroids, comets, and the Kuiper belt, and the study of exoplanets. Instructor permission required in lieu of Phy 5/10/11.","coursenotes":"Completes your NS sequence.","credits":3,"recprofs":null,"attributes":true,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":[["PHY005","PHY010","PHY011"]],"_2019":[["PHY005","PHY010","PHY011"]]}}},{"id":"BIOS001","information":{"dept":"BIOS","coursenum":"001","title":"Biology for Non-Majors","coursedesc":"Course for AP Biology Credit","coursenotes":"Only for those who received credit from the AP Bio exam.","credits":4,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"BIOS010","information":{"dept":"BIOS","coursenum":"010","title":"Bioscience in the 21st Century","coursedesc":"A multidisciplinary survey of advances in bioscience. Exploration of themebased topics (e.g., infectious diseases, cancer, genomebase medicine, engineered biomedical systems) coupled with social/ethical considerations. Three lectures per week. Participation in online multidisciplinary discussion, writing assignments, field trips, and/or other activities.","coursenotes":null,"credits":4,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"BIOS041","_cx0b9":"BIOS042","_d9ney":"TRUE","information":{"dept":"BIOS","coursenum":"041","title":"Biology Core I: Cellular and Molecular","coursedesc":"Basic building blocks and higherorder structures required for cellular processes. Topics include the character of membranes, the molecular/cellular basis of energy production, cell cycle progression, DNA replication, gene expression, signal transduction, and cell division.","coursenotes":"Designed to be taken in conjunction with BIOS 042.","credits":3,"recprofs":null,"attributes":"BIOS042TRUE","schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[["CHM030","CHM040"]],"_2019":[["CHM030","CHM040"]]}}},{"id":"BIOS042","information":{"dept":"BIOS","coursenum":"042","title":"Biology Core I: Cellular and Molecular Lab","coursedesc":"Techniques and experiments related to the principal topics covered in BIOS 041; emphasis on experimental design and scientific communication.","coursenotes":"Designed to be taken in conjunction with BIOS 041.","credits":1,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"CHM030","information":{"dept":"CHM","coursenum":"030","title":"Introduction to Chemical Principles","coursedesc":"An introduction to important topics in chemistry: atomic structure, properties of matter, chemical reactions, energy, structure and bonding in organic and inorganic compounds. The course features a lecture tightly linked to a three-hour studio experience that combines laboratory work and recitation.","coursenotes":"This is not an easy course, most CSBs don't take it unless they transferred from Engineering.","credits":4,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"CHM031","_d9ney":"TRUE","information":{"dept":"CHM","coursenum":"031","title":"Chemical Equilibria in Aqueous Systems","coursedesc":"An introduction to: intermolecular forces and their influence on physical properties and phase behavior; chemical kinetics; thermodynamics in chemical systems; and electrochemistry. The course includes a detailed treatment of equilibria in aqueous solutions, including acid-base, precipitation-solubility, metal-ligand, oxidation-reduction and distribution equilibria. The laboratory work emphasizes the qualitative and quantitative analysis of equilibria in aqueous media. Three lectures and one three-hour laboratory period.","coursenotes":"This is not an easy course, most CSBs don't take it unless they transferred from Engineering.","credits":4,"recprofs":null,"attributes":true,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[["CHM030","CHM040"]],"_2019":[["CHM030","CHM040"]]}}},{"id":"CHM040","information":{"dept":"CHM","coursenum":"040","title":"Honors General Chemistry I","coursedesc":"A first-semester course in chemistry for students planning to major in chemistry, biochemistry, chemical engineering, materials science, or other chemistry-related fields. Chemical and physical properties, structures, bonding concepts, and quantitative analysis. Laboratory includes synthesis, separation and analysis procedures; computer applications to chemistry. Three lectures and one three-hour laboratory period.","coursenotes":"This is not an easy course, most CSBs don't take it unless they transferred from Engineering.","credits":4,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":true,"summer":true},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"CHM041","_d9ney":"TRUE","information":{"dept":"CHM","coursenum":"041","title":"Honors General Chemistry II","coursedesc":"Continuation of Chemistry 40. Three lectures and one three-hour laboratory period.","coursenotes":"This is not an easy course, most CSBs don't take it unless they transferred from Engineering.","credits":4,"recprofs":null,"attributes":true,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":["CHM040"],"_2019":["CHM040"]}}},{"id":"EES002","information":{"dept":"EES","coursenum":"002","title":"Introduction to Environmental Science","coursedesc":"Focuses on natural and human-induced drivers and consequences of environmental change. Exploring options for mitigating and adapting to environmental change in ecosystems, physical and social systems, the course examines such topics as biogeochemical cycles, population pressure, ecosystem diversity, productivity and food security, energy, water resources, climate change, pollution, ozone, urban issues and sustainability. Stresses interactions using case studies. Intended for any student with an interest in the environment. May be combined with EES 022 or EES 004 for 4 credits.","coursenotes":"Not part of an EES sequence.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"EES004","information":{"dept":"EES","coursenum":"004","title":"The Science of Environmental Issues","coursedesc":"Analysis of current environmental issues from a scientific perspective. The focus on the course will be weekly discussions based on assigned readings. May be combined with other EES 3 credit courses for 4 credits.","coursenotes":"Good way to finish up the NS requirement if you need one more credit.","credits":1,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"EES011","information":{"dept":"EES","coursenum":"011","title":"Environmental Geology","coursedesc":"Analysis of the dynamic interaction of geologic processes and human activities. Catastrophic geologic processes (earthquakes, volcanoes, landslides), pollution of geologic systems, and engineering case studies. May be combined with EES 022 or EES 004 for 4 credits.","coursenotes":"Not part of an EES sequence.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"EES012","information":{"dept":"EES","coursenum":"012","title":"Glaciers and Glaciation","coursedesc":"An investigation of how cold climates and the associated processes of glaciation and periglacial activity have left their imprint on the Earth. May be combined with EES 022 or EES 004 for 4 credits.","coursenotes":"Not part of an EES sequence.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"EES021","information":{"dept":"EES","coursenum":"021","title":"Introduction to Planet Earth","coursedesc":"Processes within the Earth and dynamic interactions between the solid earth, the atmosphere, and the oceans. Lectures.","coursenotes":"Part of the EES131 Geology science chain, must take EES022.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"EES022","information":{"dept":"EES","coursenum":"022","title":"Exploring Earth","coursedesc":"Laboratory course in methods, data acquisition, data analyses and scientific communication relevant to Earth and Environmental Sciences. Building on the framework of the “Earth Science Literacy Initiative” the course introduces students to the foundations of the scientific method, the basic concepts of the Earth systems, and the influence and interaction of the natural world in everyday life. Topics include Hazards, resources, anthropogenic forcing and impacts, biogeochemical cycles and sustainability. May be combined with other EES Courses for 4 credits.","coursenotes":"The lab that must be taken to complete the EES NS sequence.","credits":1,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"EES023","information":{"dept":"EES","coursenum":"023","title":"Weather and Climate: Past, Present, and Future","coursedesc":"Introduction to the basic principles of meteorology, as they pertain to past, present, and future climates. Earth’s energy balance; cloud formation and precipitation; winds and atmospheric circulation; regional climatologies; past warm periods and ice ages in Earth’s history; the latest ideas about future climate change and global warming. Students will maintain a weather notebook to enable them to relate theory to observations from real weather data. May be combined with EES 022 or EES 004 for 4 credits.","coursenotes":"Not part of an EES sequence.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":true,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"EES024","information":{"dept":"EES","coursenum":"024","title":"Climate Change","coursedesc":"Examination and discussion of Earth’s climate history and the multiple interactions among components of the climate system, including ice, water, air, land, and vegetation; review of the causes of climate change at various time scales. Assessment of historical and future climate change and the role of humans in causing climate change, including global warming. May be combined with EES 022 or EES 004 for 4 credits.","coursenotes":"Not part of an EES sequence.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"EES025","information":{"dept":"EES","coursenum":"025","title":"The Environment and Living Systems","coursedesc":"The course will provide an introduction to the role of the environment in regulating living systems at a variety of scales and levels of organization. The role of the environment in regulating and shaping populations, communities, and ecosystems will be explored. In addition, the role of the environment will be discussed as it relates to the origin, evolution, and diversity of life on earth. Whenever possible, the role of anthropogenic environmental change will be discussed as it relates to the above topics. May be combined with EES 022 or EES 004 for 4 credits.","coursenotes":"Part of the EES152 Ecology science chain, must take EES022.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"EES026","information":{"dept":"EES","coursenum":"026","title":"Energy – Origins, Impacts, and Options","coursedesc":"Critical assessment of current and predicted energy resources used by humans, including their origins, distribution, environmental impacts, and feasibility. Lectures, discussion, field trips. May be combined with EES 022 or EES 004 for 4 credits.","coursenotes":"Not part of an EES sequence.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"EES027","information":{"dept":"EES","coursenum":"027","title":"Natural Hazards: Impacts and Consequences","coursedesc":"Earthquakes, volcanoes, tsunamis, floods, and hurricanes are a natural part of the Earth and our environment. These events have violent consequences for our lives and significant economic implications. This course examines the causes, predictability, and risk mitigation for these events. We will also consider how natural disasters are represented by popular media and whether this helps or hurts public understanding of our dynamic planet and our relationship to it. May be combined with EES 022 or EES 004 for 4.","coursenotes":"Not part of an EES sequence.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"EES028","information":{"dept":"EES","coursenum":"028","title":"Conservation and Biodiversity","coursedesc":"An introduction to the science of conservation biology. We examine the evolution of biodiversity on earth, spatial patterns of biodiversity, the impact of human activities on biodiversity, and assess strategies for the management and conservation of biodiversity. Students gain the scientific literacy necessary to make informed decisions about topics such as wilderness preservation, species conservation, and land use. May be combined with EES 022 or EES 004 for 4 credits.","coursenotes":"Part of the EES152 Ecology science chain, must take EES022.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":true,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"EES032","information":{"dept":"EES","coursenum":"032","title":"Oceanography","coursedesc":"An introduction to the structure, composition, and processes of the earth from a marine perspective. Topics include earth structure, plate tectonics, continental margins, coastal processes, seawater chemistry, ocean circulation, wave dynamics, primary productivity, plankton and plants, marine organisms and communities. May be combined with EES 022 or EES 004 for 4 credits.","coursenotes":"Not part of an EES sequence.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":true,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"EES131","_d9ney":"TRUE","information":{"dept":"EES","coursenum":"131","title":"Introduction to Rocks and Minerals","coursedesc":"Hand-specimen identification of the major mineral groups and rock types. Atomic structure of minerals; relationship of mineral structure to chemical and physical properties. Placement of igneous, sedimentary, and metamorphic rocks into a plate tectonics context. Introduction to optical mineralogy and x-ray diffraction techniques. Lectures, laboratories, field trips.","coursenotes":"Finishes the science chain for EES.","credits":4,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":true,"summer":null},"prereqs":{"_2018":["EES021","EES022"],"_2019":["EES021","EES022"]}}},{"id":"EES152","_d9ney":"TRUE","information":{"dept":"EES","coursenum":"152","title":"Ecology","coursedesc":"The study of relationships among organisms and their physical environment. Ecology of individual organisms, populations, communities, ecosystems, landscapes, and the biosphere. Topics include organism adaptations and natural selection, life histories, population growth and dynamics, species interactions, energy flow, nutrient cycling, and ecological impacts of human activities. Field-based laboratories focus on the quantitative study of biological populations and communities. Lectures, field-based laboratories, and applied activities.","coursenotes":"Finishes the science chain for EES.","credits":4,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":[["EES025","EES028"],"EES022"],"_2019":[["EES025","EES028"],"EES022"]}}},{"id":"PHY005","information":{"dept":"PHY","coursenum":"005","title":"Concepts In Physics","coursedesc":"Fundamental discoveries and concepts of physics and their relevance to current issues and modern technology. For students not intending to major in science or engineering. Lectures, demonstrations, group activities, and laboratories using modern instrumentation and computers. This is a non-calculus course; no previous background in physics is assumed. Three class meetings and one laboratory period per week.","coursenotes":"Much easier than normal physics, rarely offered.","credits":4,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":true,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"PHY010","_cx0b9":"PHY012","information":{"dept":"PHY","coursenum":"010","title":"General Physics I","coursedesc":"Statics, dynamics, conservation laws, thermodynamics, kinetic theory of gases, fluids. Primarily for architecture, biological science, earth and environmental science students.","coursenotes":"An easier version of PHY011 that engineers don't take.","credits":4,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"PHY011","_cx0b9":"PHY012","information":{"dept":"PHY","coursenum":"011","title":"Introductory Physics I","coursedesc":"Kinematics, frames of reference, laws of motion in Newtonian theory and in special relativity, conservation laws, as applied to the mechanics of mass points; temperature, heat and the laws of thermodynamics; kinetic theory of gases. Two lectures and two recitations per week.","coursenotes":"The engineering physics I, fairly difficult.","credits":4,"recprofs":"Licini","attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"PHY012","information":{"dept":"PHY","coursenum":"012","title":"Introductory Physics Laboratory I","coursedesc":"A laboratory course taken concurrently with PHY 10 or 11. Experiments in mechanics, heat, and DC electrical circuits. One three-hour laboratory period per week.","coursenotes":"The lab for PHY010 and PHY011, must be taken if physics or astronomy is your sequence.","credits":1,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}},{"id":"PHY013","_cx0b9":"PHY021","_d9ney":"TRUE","information":{"dept":"PHY","coursenum":"013","title":"General Physics II","coursedesc":"A continuation of PHY 10, primarily for biological science and earth and environmental science students. Electrostatics, electromagnetism, light, sound, atomic physics, nuclear physics, and radioactivity.","coursenotes":"An easier version of PHY021 that engineers don't take. PHY022 is optional, but may be necessary depending on your credits to complete the NS requirement.","credits":3,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":true,"summer":null},"prereqs":{"_2018":[["PHY010","PHY011"],"PHY012"],"_2019":[["PHY010","PHY011"],"PHY012"]}}},{"id":"PHY021","_cx0b9":"PHY021","_d9ney":"TRUE","information":{"dept":"PHY","coursenum":"021","title":"Introductory Physics II","coursedesc":"A continuation of PHY 11. Electrostatics and magnetostatics; DC circuits; Maxwell’s equations; waves; physical and geometrical optics; introduction to modern physics. Two lectures and two recitations per week. May not be taken by students who have previously completed PHY 023.","coursenotes":"The engineering physics II, very difficult.","credits":4,"recprofs":"Licini","attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":["PHY011","PHY012"],"_2019":["PHY011","PHY012"]}}},{"id":"PHY022","_d9ney":"TRUE","information":{"dept":"PHY","coursenum":"022","title":"Introductory Physics Laboratory II","coursedesc":"A laboratory course to be taken concurrently with PHY 13 or 21. One three-hour laboratory period per week.","coursenotes":"The lab for PHY013 and PHY021, optional depending on the number of credits you have for completing the NS.","credits":1,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":null,"spring":null,"summer":null},"prereqs":{"_2018":[["PHY010","PHY011"],"PHY012"],"_2019":[["PHY010","PHY011"],"PHY012"]}}},{"id":"PSYC012","information":{"dept":"PSYC","coursenum":"012","title":"Introduction to Human Neuroscience","coursedesc":"In this introductory course, we will uncover how our brains are able to give rise to the complexities of human thought and behavior. We will examine the neural bases of seeing, hearing, sleep, dreaming, sexual behavior, emotion, aggression, behavioral disorders, learning, and memory.","coursenotes":"Not part of a sequence, but can complete 4 NS credits.","credits":4,"recprofs":null,"attributes":null,"schedule":{"winter":null,"fall":true,"spring":null,"summer":null},"prereqs":{"_2018":[],"_2019":[]}}}],"DEPT_REF":[{"dept":"ACCT","deptname":"Accounting","college":"CBE","link":"accounting"},{"dept":"BUS","deptname":"Business","college":"CBE","link":"business"},{"dept":"CSB","deptname":"Computer Science and Business","college":"IC","link":"computerscienceandbusinessprogram"},{"dept":"CSE","deptname":"Computer Science and Engineering","college":"CEAS","link":"computerscienceandengineering"},{"dept":"ECO","deptname":"Economics","college":"CBE","link":"economics"},{"dept":"ENGL","deptname":"English","college":"CAS","link":"english"},{"dept":"ENGR","deptname":"Engineering","college":"CEAS","link":"engineering"},{"dept":"FIN","deptname":"Finance","college":"CBE","link":"finance"},{"dept":"LAW","deptname":"Law","college":"CBE","link":"law"},{"dept":"MATH","deptname":"Mathematics","college":"CAS","link":"mathematics"},{"dept":"MGT","deptname":"Management","college":"CBE","link":"management"},{"dept":"MKT","deptname":"Marketing","college":"CBE","link":"marketing"},{"dept":"SCM","deptname":"Supply Chain Management","college":"CBE","link":"supplychainmanagement"},{"dept":"ANTH","deptname":"Anthropology","college":"CAS","link":"sociologyandanthropology"},{"dept":"ASTR","deptname":"Astronomy","college":"CAS","link":"astronomyandastrophysics"},{"dept":"BIOS","deptname":"Biological Sciences","college":"CAS","link":"biologicalsciences"},{"dept":"CHM","deptname":"Chemistry","college":"CAS","link":"chemistry"},{"dept":"EES","deptname":"Earth and Environmental Sciences","college":"CAS","link":"earthandenvironmentalsciences"},{"dept":"PHY","deptname":"Physics","college":"CAS","link":"physics"},{"dept":"PSYC","deptname":"Psychology","college":"CAS","link":"psychology"}],"COLLEGE_REF":[{"college":"CBE","collegename":"College of Business and Economics","link":"businessandeconomics"},{"college":"IC","collegename":"Intercollegiate Programs","link":"interdisciplinaryundergraduatestudy"},{"college":"CEAS","collegename":"P.C. Rossin College of Engineering and Applied Science","link":"engineeringandappliedscience"},{"college":"CAS","collegename":"College of Arts and Sciences","link":"artsandsciences"}],"ELECTIVES":[{"elective":"PRO","electivename":"Professional","reqcredits":"9","electivedesc":"Students may choose to use their CSB professional electives to develop concentrations in particular areas of computer science, business, or the intersection of these fields. It is not required that a student complete a track, just that students fulfill the 9-credit professional elective requirement.","electivenotes":"All professional electives must be approved by either Prof. Korth OR Prof. Hall, and not all of the courses for every track are offered on a regular basis. Any reasonable course with clear professional development opportunity will typically get approved."},{"elective":"TECH","electivename":"Technical","reqcredits":"3","electivedesc":"In addition to all required CSE courses, all students must choose at least one CSE course from the list provided in the link above.","electivenotes":"Not all of the courses are offered on a regular basis, it is recommended the course matches your interests."},{"elective":"SS","electivename":"Social Science","reqcredits":"3","electivedesc":"Three credits are required of courses designated as Social Sciences (SS) by the course catalog. If you intend to minor in a field in the social sciences, it is recommended you tailor your electives accordingly!","electivenotes":"Most SS courses are 4 credits, but if you can find a 3 credit one go for it."},{"elective":"NS","electivename":"Natural Science","reqcredits":"12","electivedesc":"Twelve credits are required of courses designated as Natural Sciences (NS) by the course catalog. Additionally, at least one course must have an attached laboratory and two courses must be in a laboratory science with the first course as a prerequisite to the second course. There are some NS courses that, though in a laboratory science, do not include a laboratory; instead the “attached lab” has a separate course number. Check the link above for a partial list of sample science sequences. ","electivenotes":"It is STRONGLY recommended to finish your NS chain before beginning CSB capstone (312/313) in the spring of your junior year. Any course used for the science requirement must have an “NS” designation in the catalog (and there are some CHM, BIOS, and EES courses that are not “NS” but rather “ND,” meaning “not designated”). The exact set of courses available depends on what each science department offers each semester. Plan carefully!"},{"elective":"HU","electivename":"Humanities","reqcredits":"6","electivedesc":"Six credits are required of courses designated as Humanities (HU) by the course catalog. If you intend to minor in a field in the humanities, it is recommended you tailor your electives accordingly!","electivenotes":"Dance, theater, and language classes are good 2 credit courses to take."},{"elective":"FREE","electivename":"Free","reqcredits":"136 Total","electivedesc":"Utilize these free credits to take courses that interest you or help you complete any minors you may have! ","electivenotes":"Any additional credits beyond the other requirements will spillover into the free elective requirement. You must have 136 credits in total to graduate."}],"TRANSFER_CREDIT":[{"transferid":"AP Biology","type":"AP","name":"Biology","transfer":[{"categories":"1-3","credits":null},{"categories":"4-5","credits":["BIOS001"]}]},{"transferid":"AP Chemistry","type":"AP","name":"Chemistry","transfer":[{"categories":"1-4","credits":null},{"categories":"5","credits":["CHM030"]}]},{"transferid":"AP Computer Science A","type":"AP","name":"Computer Science A","transfer":[{"categories":"1-3","credits":null},{"categories":"4-5","credits":["CSE001","CSE002"]}]},{"transferid":"AP Computer Science Principles","type":"AP","name":"Computer Science Principles","transfer":[{"categories":"1-3","credits":null},{"categories":"4-5","credits":["CSE012"]}]},{"transferid":"AP Environmental Science","type":"AP","name":"Environmental Science","transfer":[{"categories":"1-3","credits":null},{"categories":"4-5","credits":["EES002","EES022"]}]},{"transferid":"AP Microeconomics","type":"AP","name":"Microeconomics","transfer":[{"categories":"1-3","credits":null},{"categories":"4-5","credits":["2FC","*ECO001"]}]},{"transferid":"AP Macroeconomics","type":"AP","name":"Macroeconomics","transfer":[{"categories":"1-3","credits":null},{"categories":"4-5","credits":["2FC","*ECO001"]}]},{"transferid":"AP English Language and Composition","type":"AP","name":"English Language and Composition","transfer":[{"categories":"1-3","credits":null},{"categories":"4","credits":["ENGL001"]},{"categories":"5","credits":["ENGL001","ENGL002"]}]},{"transferid":"AP English Literature and Composition","type":"AP","name":"English Literature and Composition","transfer":[{"categories":"1-3","credits":null},{"categories":"4","credits":["ENGL001"]},{"categories":"5","credits":["ENGL001","ENGL002"]}]},{"transferid":"AP Calculus AB","type":"AP","name":"Calculus AB","transfer":[{"categories":"1-3","credits":null},{"categories":"4-5","credits":["MATH021"]}]},{"transferid":"AP Calculus BC","type":"AP","name":"Calculus BC","transfer":[{"categories":"1-3","credits":null},{"categories":"4-5","credits":["MATH021","MATH022"]}]},{"transferid":"AP Physics 1: Algebra-Based","type":"AP","name":"Physics 1: Algebra-Based","transfer":[{"categories":"1-4","credits":null},{"categories":"5","credits":["PHY011","PHY012"]}]},{"transferid":"AP Physics C: Mechanics","type":"AP","name":"Physics C: Mechanics","transfer":[{"categories":"1-3","credits":null},{"categories":"4-5","credits":["PHY011","PHY012"]}]},{"transferid":"AP Physics C: Electricity and Magnetism","type":"AP","name":"Physics C: Electricity and Magnetism","transfer":[{"categories":"1-3","credits":null},{"categories":"4-5","credits":["@PHY021","PHY022"]}]},{"transferid":"AP Statistics","type":"AP","name":"Statistics","transfer":[{"categories":"1-3","credits":null},{"categories":"4-5","credits":["ECO045"]}]},{"transferid":"SAT Evidence-Based Reading & Writing","type":"SAT","name":"Evidence-Based Reading & Writing","transfer":[{"categories":"<700","credits":null},{"categories":"700-749","credits":["ENGL001"]},{"categories":"750-800","credits":["ENGL001","ENGL002"]}]},{"transferid":"SAT Essay","type":"SAT","name":"Essay","transfer":[{"categories":"<6 On Any Part","credits":null},{"categories":">= 6 On All Three Parts","credits":["ENGL001"]},{"categories":">= 7 On All Three Parts","credits":["ENGL001","ENGL002"]}]},{"transferid":"ACT English","type":"ACT","name":"English","transfer":[{"categories":"<32","credits":null},{"categories":"32-34","credits":["ENGL001"]},{"categories":"35-36","credits":["ENGL001","ENGL002"]}]},{"transferid":"ACT Writing","type":"ACT","name":"Writing","transfer":[{"categories":"<10","credits":null},{"categories":"10","credits":["ENGL001"]},{"categories":"11-12","credits":["ENGL001","ENGL002"]}]},{"transferid":"IB English","type":"IB","name":"English","transfer":[{"categories":"<5","credits":null},{"categories":"5-7","credits":["ENGL001"]}]},{"transferid":"IB High-level Mathematics","type":"IB","name":"High-level Mathematics","transfer":[{"categories":"<5","credits":null},{"categories":"5-7","credits":["MATH021"]}]}],"MINORS":[{"minor":"Entrepreneurship","desc":"lol"},{"minor":"Marketing","desc":"lol2"},{"minor":"Management","desc":"lol3"},{"minor":"Business Information Systems","desc":"lol4"}]}