[{"elective":"PRO","electivename":"Professional","reqcredits":"9","electivedesc":"Students may choose to use their CSB professional electives to develop concentrations in particular areas of computer science, business, or the intersection of these fields. It is not required that a student complete a track, just that students fulfill the 9-credit professional elective requirement.","electivenotes":"All professional electives must be approved by either Prof. Korth OR Prof. Hall, and not all of the courses for every track are offered on a regular basis. Any reasonable course with clear professional development opportunity will typically get approved."},{"elective":"TECH","electivename":"Technical","reqcredits":"3","electivedesc":"In addition to all required CSE courses, all students must choose at least one CSE course from the list provided in the link above.","electivenotes":"Not all of the courses are offered on a regular basis, it is recommended the course matches your interests."},{"elective":"SS","electivename":"Social Science","reqcredits":"3","electivedesc":"Three credits are required of courses designated as Social Sciences (SS) by the course catalog. If you intend to minor in a field in the social sciences, it is recommended you tailor your electives accordingly!","electivenotes":"Most SS courses are 4 credits, but if you can find a 3 credit one go for it."},{"elective":"NS","electivename":"Natural Science","reqcredits":"12","electivedesc":"Twelve credits are required of courses designated as Natural Sciences (NS) by the course catalog. Additionally, at least one course must have an attached laboratory and two courses must be in a laboratory science with the first course as a prerequisite to the second course. There are some NS courses that, though in a laboratory science, do not include a laboratory; instead the “attached lab” has a separate course number. Check the link above for a partial list of sample science sequences. ","electivenotes":"It is STRONGLY recommended to finish your NS chain before beginning CSB capstone (312/313) in the spring of your junior year. Any course used for the science requirement must have an “NS” designation in the catalog (and there are some CHM, BIOS, and EES courses that are not “NS” but rather “ND,” meaning “not designated”). The exact set of courses available depends on what each science department offers each semester. Plan carefully!"},{"elective":"HU","electivename":"Humanities","reqcredits":"6","electivedesc":"Six credits are required of courses designated as Humanities (HU) by the course catalog. If you intend to minor in a field in the humanities, it is recommended you tailor your electives accordingly!","electivenotes":"Dance, theater, and language classes are good 2 credit courses to take."},{"elective":"FREE","electivename":"Free","reqcredits":"136 Total","electivedesc":"Utilize these free credits to take courses that interest you or help you complete any minors you may have! ","electivenotes":"Any additional credits beyond the other requirements will spillover into the free elective requirement. You must have 136 credits in total to graduate."}]